print('Введите фразу используя латинские буквы, цифры и символ пробела, программа выведет фразу используя код Морзе')
letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']
l = []
for i in range(len(morse)):
    l.append((letters[i], morse[i]))
my_dict = dict(l)

s =input().upper()
s = s.replace(' ', '')
for i in range(len(s)):
    if s[i] in my_dict:
        print(my_dict[s[i]], end=' ')
x = input()